# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
     [-1, 1, Silence, []],  #0
     [-1, 1, SpectralFeatureAdaptation, [3]], #1
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 2-P1/2

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 3-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 4

   # conv down
   [-1, 1, ADown, [128]],  # 5-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 6

   # conv down
  [-1, 1, ADown, [256]],  # 7-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 8

   # conv down
   [-1, 1, ADown, [256]],   # 9-P5/32
     [-1, 1, CBAM, [256]], #10

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 11
  ]

# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [256, 128]],  # 12

      # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #13
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4 14

      # elan-2 block
   [-1, 1, depthwise_separable_conv, [256, 3, 1]],  # 15

      # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #16
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3 17

      # elan-2 block
   [-1, 1, depthwise_separable_conv, [128, 3, 1]], # 18 (P3/8-small)

      # conv-down merge
   [-1, 1, Conv, [128, 3, 2]], #19
   [[-1, 15], 1, Concat, [1]],  # cat head P4 20

      # elan-2 block
    [-1, 1, depthwise_separable_conv, [256, 3, 1]], # 21 (P4/16-medium)

      # conv-down merge
   [-1, 1, Conv, [256, 3, 2]], #22
   [[-1, 12], 1, Concat, [1]],  # cat head P5 23

      # elan-2 block
   [-1, 1, depthwise_separable_conv, [256, 3, 1]],  # 24 (P5/32-large)


   # multi-level reversible auxiliary branch

      # routing
   [6, 1, CBLinear, [[128]]], # 25
   [8, 1, CBLinear, [[128, 256]]], # 26
   [11, 1, CBLinear, [[128, 256, 256]]], # 27

      # conv down
   [0, 1, Conv, [32, 3, 2]],  # 28-P1/2

      # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 29-P2/4

      # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 30

      # conv down fuse
   [-1, 1, Conv, [128, 3, 2]],  # 31-P3/8
   [[25, 26, 27, -1], 1, CBFuse, [[0, 0, 0]]], # 32
     [-1, 1, CoordAtt, [128, 128, ]], #33

      # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 34

      # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  # 35-P4/16
   [[26, 27, -1], 1, CBFuse, [[1, 1]]], # 36
     [-1, 1, CoordAtt, [256, 256, ]], #37

      # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 38

      # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  # 39-P5/32
   [[27, -1], 1, CBFuse, [[2]]], # 40
   [-1, 1, CoordAtt, [256, 256, ]], #41

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 42

   [31, 1, RepNCSPELAN4, [256, 128, 64, 2]],  # 43

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 44
   [-1, 1, Conv, [128, 3, 1]], # 45

   [16, 1, RepNCSPELAN4, [128, 128, 64, 2]],  # 46

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 47
   [-1, 1, Conv, [128, 3, 1]], # 48

   # segment
   [[34, 38, 42, 18, 21, 24, 45, 48], 1, DualDSegment, [nc, 32, 256]],  # Segment(P3, P4, P5)
  ]
